In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib as plt
import warnings
warnings.filterwarnings('ignore')
# import mysql.connector as sql
import sqlite3

from sqlalchemy import create_engine

In [2]:
clean_income_and_age = pd.read_csv('./CleanData/clean_annual_income_and_age.csv')
clean_income_and_age.head(3)

,Unnamed: 0,cust_id,name,gender,age,location,occupation,annual_income,marital_status
0,0,1,Manya Acharya,Female,51.0,City,Business Owner,358211.0,Married
1,1,2,Anjali Pandey,Female,47.0,City,Consultant,65172.0,Single
2,2,3,Aaryan Chauhan,Male,21.0,City,Freelancer,22378.0,Married

#### Task
##### Figure Out Income Distribution by Age, Occupation, Gender and Location age MUST be between 15 and 85

In [3]:
clean_income_and_age.age.min(), clean_income_and_age.age.max()

(18.0, 64.0)

In [4]:
clean_income_and_age.annual_income.min(), clean_income_and_age.annual_income.max()

(5175.0, 449346.0)

In [5]:
pd.DataFrame(clean_income_and_age.columns)

                0
0      Unnamed: 0
1         cust_id
2            name
3          gender
4             age
5        location
6      occupation
7   annual_income
8  marital_status

In [6]:
clean_income_and_age.gender.value_counts(dropna=False)

Male      674
Female    326
Name: gender, dtype: int64

In [8]:
clean_income_and_age.occupation.value_counts(dropna=False)

Business Owner         289
Freelancer             228
Data Scientist         184
Fullstack Developer    148
Consultant              97
Artist                  38
Accountant              16
Name: occupation, dtype: int64

In [7]:
clean_income_and_age.location.value_counts(dropna=False)

City      683
Suburb    232
Rural      85
Name: location, dtype: int64

In [9]:
clean_income_and_age.marital_status.value_counts(dropna=False)

Married    775
Single     225
Name: marital_status, dtype: int64

In [17]:
annualincome_by_ms = clean_income_and_age.groupby('marital_status')['annual_income'].median().reset_index()
pd.DataFrame(annualincome_by_ms)

  marital_status  annual_income
0        Married       115498.0
1         Single       114178.0

In [18]:
annualincome_by_msSum = clean_income_and_age.groupby('marital_status')['annual_income'].sum().reset_index()
pd.DataFrame(annualincome_by_msSum)

  marital_status  annual_income
0        Married    108848222.5
1         Single     31635326.0

In [19]:
annualincome_by_ms = clean_income_and_age.groupby('marital_status')['annual_income'].mean().reset_index()
pd.DataFrame(annualincome_by_ms)

  marital_status  annual_income
0        Married  140449.319355
1         Single  140601.448889

In [20]:
annualincome_occup = clean_income_and_age.groupby('occupation')['annual_income','age'].mean().reset_index()
pd.DataFrame(annualincome_occup)

            occupation  annual_income        age
0           Accountant   64123.562500  31.812500
1               Artist   45309.236842  26.026316
2       Business Owner  268447.368512  49.501730
3           Consultant   60703.154639  45.484536
4       Data Scientist  137021.266304  32.173913
5           Freelancer   76327.508772  23.877193
6  Fullstack Developer   78727.972973  26.766892

In [21]:
annualincome_age = round(clean_income_and_age.groupby('occupation')['annual_income','age'].mean().reset_index(),1)
pd.DataFrame(annualincome_age)

            occupation  annual_income   age
0           Accountant        64123.6  31.8
1               Artist        45309.2  26.0
2       Business Owner       268447.4  49.5
3           Consultant        60703.2  45.5
4       Data Scientist       137021.3  32.2
5           Freelancer        76327.5  23.9
6  Fullstack Developer        78728.0  26.8

In [22]:
location_gender = clean_income_and_age.groupby('location')['gender'].count().reset_index()
pd.DataFrame(location_gender)

  location  gender
0     City     683
1    Rural      85
2   Suburb     232

In [26]:
location_gender2 = clean_income_and_age.groupby(['gender','location'])['location'].count()
pd.DataFrame(location_gender2)

                 location
gender location
Female City           226
       Rural           26
       Suburb          74
Male   City           457
       Rural           59
       Suburb         158

##### Visual Distribution

In [ ]:
annualincome_by_ms

In [29]:
plt.figure(figsize=(8, 5))
plt.bar(annualincome_by_ms['marital_status'], annualincome_by_ms['annual_income'], color=['blue', 'orange'])

# Adding labels and title
plt.xlabel('marital_status')
plt.ylabel('annual_income')
plt.title('Annual Income Grouped by Marital Status')

# Display the plot
plt.show()

TypeError: 'module' object is not callable